/*--------------------------------------------------------------------------+
|  File Name:  Message.c, v1.1.1                                            |
|  Author:     aaron.xu1982@gmail.com                                       |
|  Date:       2011.09.26                                                   |
+---------------------------------------------------------------------------+
|  Description: 基于 FreeRTOS 的消息机制的实现。                            |
|                                                                           |
+---------------------------------------------------------------------------+
|  Release Notes:                                                           |
|                                                                           |
|  Logs:                                                                    |
|  WHO       WHEN         WHAT                                              |
|  ---       ----------   --------------------------------------------------|
|  Aaron     2008.03.06   born                                              |
|  Aaron     2008.04.06   修改存放消息的内存管理方法为系统分配内存池方式    |
|  Aaron     2011.09.26   从uC/OS II环境移植到FreeRTOS环境                  |
|                                                                           |
+--------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------+
| Include files                                                             |
+--------------------------------------------------------------------------*/
//#include "stm32f10x_type.h"
#include "FreeRTOS.h"
#include "queue.h"

#include "message.h"

/*----------------------------------------------------------------------------+
| Type Definition & Macro                                                     |
+----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------+
| Internal Variables                                                          |
+----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------+
| System Initialization Routines                                              |
+----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------+
| General Subroutines                                                         |
+----------------------------------------------------------------------------*/
// 从消息堆栈中读取一条消息
// pQueue:  指向一个消息队列的指针，GetMessage()从该消息队列中获得消息
// pMsg:    指向返回的消息存放的消息结构体的指针
// TimeOut: 超时时间
bool GetMessage(xQueueHandle pQueue, PMSG pMsg, UINT32 TimeOut)
{
	if (xQueueReceive(pQueue, pMsg, TimeOut ) != pdPASS)
	{
		// 队列中没有消息，返回一个空消息
		pMsg->Msg = MSG_NULL;
		return FALSE;
	}
	return TRUE;
}

// 发送一个特定的消息到指定的消息堆栈，首先申请一块内存用来存放消息及参数，然后
// 将该内存的地址发往指定的队列
// *pQueue:     指向将该消息发往的消息队列的指针
// MessageType: 需要发送的消息类型
// wParam:      16位参数
// lParam:      32位参数
void PostMessage(xQueueHandle pQueue, UINT16 MessageType, UINT16 wParam, UINT32 lParam)
{
	MSG   Msg;

	Msg.Msg = MessageType;
	Msg.wParam = wParam;
	Msg.lParam = lParam;
	// 将该地址发往指定的消息队列
	xQueueSend(pQueue, &Msg, portMAX_DELAY);
}

// 清空消息缓冲区中的所有消息
void ClearMessage(xQueueHandle pQueue)
{
	MSG   Msg;

	while (xQueueReceive(pQueue, &Msg, 0) == pdPASS) ;
}

/*----------------------------------------------------------------------------+
| End of source file                                                          |
+----------------------------------------------------------------------------*/
/*------------------------ Nothing Below This Line --------------------------*/